nicolas-codemate/esp32-pixelcast/src/main.cpp
    // POST /api/brightness - Set brightness (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* brightnessHandler = new AsyncCallbackJsonWebHandler("/api/brightness",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /brightness handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            if (!doc["brightness"].isNull()) {
                uint8_t brightness = doc["brightness"].as<uint8_t>();
                displaySetBrightness(brightness);
                settings.brightness = brightness;
                saveSettings();
                Serial.printf("[API] Brightness set to %d\n", brightness);
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing brightness\"}");
            }
        });
    webServer.addHandler(brightnessHandler);

    // POST /api/custom - Create/update custom app (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* customHandler = new AsyncCallbackJsonWebHandler("/api/custom",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /custom handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Get app name from query param or JSON
            String name;
            if (request->hasParam("name")) {
                name = request->getParam("name")->value();
            } else if (!doc["name"].isNull()) {
                name = doc["name"].as<String>();
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
                return;
            }

            const char* text = doc["text"] | "";
            const char* icon = doc["icon"] | "";

            // Parse color (can be hex string or RGB array)
            uint32_t textColor = 0xFFFFFF;
            if (!doc["color"].isNull()) {
                if (doc["color"].is<JsonArray>()) {
                    JsonArray arr = doc["color"];
                    if (arr.size() == 3) {
                        textColor = ((uint32_t)arr[0].as<uint8_t>() << 16) |
                                    ((uint32_t)arr[1].as<uint8_t>() << 8) |
                                    (uint32_t)arr[2].as<uint8_t>();
                    }
                } else if (doc["color"].is<const char*>()) {
                    textColor = strtoul(doc["color"].as<const char*>() + 1, NULL, 16);
                } else {
                    textColor = doc["color"].as<uint32_t>();
                }
            }

            uint32_t bgColor = 0;
            if (!doc["background"].isNull()) {
                if (doc["background"].is<JsonArray>()) {
                    JsonArray arr = doc["background"];
                    if (arr.size() == 3) {
                        bgColor = ((uint32_t)arr[0].as<uint8_t>() << 16) |
                                  ((uint32_t)arr[1].as<uint8_t>() << 8) |
                                  (uint32_t)arr[2].as<uint8_t>();
                    }
                } else {
                    bgColor = doc["background"].as<uint32_t>();
                }
            }

            uint16_t duration = doc["duration"] | settings.defaultDuration;
            uint32_t lifetime = doc["lifetime"] | 0;
            int8_t priority = doc["priority"] | 0;

            int8_t result = appAdd(name.c_str(), text, icon, textColor, bgColor,
                                   duration, lifetime, priority, false);

            if (result >= 0) {
                Serial.printf("[API] Custom app '%s' created/updated\n", name.c_str());
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(500, "application/json", "{\"error\":\"Failed to add app\"}");
            }
        });
    webServer.addHandler(customHandler);

    // DELETE /api/custom - Delete custom app
    webServer.on("/api/custom", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("name")) {
            request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
            return;
        }

        String name = request->getParam("name")->value();
        if (appRemove(name.c_str())) {
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"App not found or is system app\"}");
        }
    });

    // POST /api/settings - Update settings (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* settingsHandler = new AsyncCallbackJsonWebHandler("/api/settings",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /settings handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Update settings from JSON
            if (!doc["brightness"].isNull()) {
                settings.brightness = doc["brightness"].as<uint8_t>();
                displaySetBrightness(settings.brightness);
            }
            if (!doc["autoRotate"].isNull()) {
                settings.autoRotate = doc["autoRotate"].as<bool>();
                appRotationEnabled = settings.autoRotate;
            }
            if (!doc["defaultDuration"].isNull()) {
                settings.defaultDuration = doc["defaultDuration"].as<uint16_t>();
            }

            saveSettings();
            Serial.println("[API] Settings updated");
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(settingsHandler);

    // POST /api/reboot - Reboot device (deferred to allow response to be sent)
    webServer.on("/api/reboot", HTTP_POST, [](AsyncWebServerRequest *request) {
        Serial.println("[API] Reboot requested");
        request->send(200, "application/json", "{\"success\":true,\"message\":\"Rebooting...\"}");
        pendingReboot = true;
        rebootRequestTime = millis();
    });

    // ========================================================================
    // Icon Management API
    // ========================================================================

    // GET /icons.html - Web interface for icon management
    webServer.on("/icons.html", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(200, "text/html", ICONS_HTML);
    });

    // GET /api/icons/{name} - Serve icon file (must be before /api/icons to avoid prefix match)
    webServer.on("^\\/api\\/icons\\/([a-zA-Z0-9_-]+)$", HTTP_GET, [](AsyncWebServerRequest *request) {
        String iconName = request->pathArg(0);
        handleApiIconsServe(request, iconName);
    });

    // GET /api/icons - List all icons
    webServer.on("/api/icons", HTTP_GET, handleApiIconsList);

    // DELETE /api/icons?name={name} - Delete an icon
    webServer.on("/api/icons", HTTP_DELETE, handleApiIconsDelete);

